import { useNavigate, useParams } from 'react-router-dom'
import { Button, Icon } from '../ui'

export const BlogPost = () => {
  const { id } = useParams()

  const navigate = useNavigate()

  const currentBlog = Number(id)

  const handelNavigation = (path: number) => {
    if (path >= 0) navigate(`/blog/${path}`)
  }

  return (
    <section>
      <div className='container desktop:w-[1070px]'>
        <h1 className='text-black text-1xl font-semibold mb-10'>
          Оформлення вітальні. Які м'які меблі краще вибрати?
        </h1>
        <img
          src='/news.jpg'
          alt='furniture'
          className='w-full rounded-lg h-[380px] mb-10 object-cover'
        />
        <p className='text-black text-base mb-10'>
          Вітальня – це основна кімната у кожному будинку. Саме вона служить для
          прийому гостей, проведення часу всією сім'єю та просто для відпочинку
          у приємній теплій атмосфері. Оформляючи свій будинок та вітальню
          зокрема, всі намагаються зробити її максимально зручною, комфортною та
          красивою. Основним та центральним елементом оформлення вітальні, як і
          будь-якої іншої кімнати, є м'які меблі. Будь-які меблі для вітальні
          повинні бути не тільки стильними і красивими, але і функціональними.
          На таких меблів має бути зручно та приємно відпочивати та приймати
          гостей. Однак сьогодні існує величезна різноманітність
          найрізноманітніших м'яких меблів для вітальні, яка підходить для
          кімнат різних розмірів і форм. На чому варто зупинити свій вибір? Як
          краще оформити свою вітальню, щоб вам було комфортно, а гості хотіли
          приходити до вас знову та знову?
        </p>
        <h2 className='text-black text-lg font-semibold mb-[30px]'>
          На сайті інтернет магазину Кровато представлено велику різноманітність
          м'яких меблів для вітальні, серед яких кожен зможе вибрати для себе
          найбільш вдалий варіант. У нас ви знайдете:
        </h2>
        <ul className='flex flex-col gap-5 mb-10'>
          <li className='flex gap-3.5'>
            <Icon
              className='size-8'
              name='icon-mark'
            />
            <p className='text-black text-base w-11/12'>
              Прямі дивани. Такі дивани вважаються класикою. Вони підходять для
              віталень будь-яких форм та розмірів. Прямий диван виглядає стильно
              та лаконічно, на ньому зручно відпочивати, приймати гостей або
              навіть спати. Прямі дивани можуть стояти біля стіни, так і в
              центрі кімнати. Багато моделей прямих диванів легко розкладаються,
              перетворюючись на повноцінне спальне місце. Також більшість
              диванів мають великі та місткі ніші, які є додатковим місцем для
              зберігання;
            </p>
          </li>
          <li className='flex gap-3.5'>
            <Icon
              className='size-8'
              name='icon-mark'
            />
            <p className='text-black text-base w-11/12'>
              Кутові дивани Кутові дивани вважаються найзручнішими та
              комфортнішими. Вони ідеально підійдуть для приємного проведення
              часу в колі сім'ї або друзів. Кутові дивани в основному
              використовуються для оформлення великих віталень, так як вони
              займають багато місця, і для кімнат з невеликою площею просто не
              підійдуть;
            </p>
          </li>
          <li className='flex gap-3.5'>
            <Icon
              className='size-8'
              name='icon-mark'
            />
            <p className='text-black text-base w-11/12'>
              Тахти. Тахта - це одна з варіацій дивана, але стильніша і
              мінімалістична. Виглядають тахти дуже незвично і можуть підійти
              для будь-якого інтер'єру. Також тахти більше ніж звичайні дивани
              підходять для сну, оскільки в їх основі не пружинні блоки, а
              дерев'яні ламелі або ортопедичні матраци;
            </p>
          </li>
          <li className='flex gap-3.5'>
            <Icon
              className='size-8'
              name='icon-mark'
            />
            <p className='text-black text-base w-11/12'>
              Крісла. Крісло – це особливий предмет інтер'єру. Сучасні дизайнери
              не часто використовують його, вважаючи застарілим, проте саме
              крісла створюють особливий затишок та комфорт у будь-якій кімнаті.
              Сьогодні існує величезна різноманітність класичних та сучасних
              моделей крісел, що дозволяє кожному відшукати ідеальне крісло для
              свого будинку;
            </p>
          </li>
          <li className='flex gap-3.5'>
            <Icon
              className='size-8'
              name='icon-mark'
            />
            <p className='text-black text-base w-11/12'>
              Набір меблів. Комплект м'яких меблів – це відмінне рішення для
              тих, хто хоче меблювати свою вітальню не лише диваном, а й
              кріслами. Існують набори з одним або двома кріслами, із прямими
              або кутовими диванами. Основна перевага будь-якого готового
              меблевого гарнітура – це те, що предмети меблів у ньому ідеально
              поєднуються один з одним, і вам не потрібно буде витрачати свій
              час та сили на їхній підбір.
            </p>
          </li>
        </ul>
        <p className='text-black text-base mb-10'>
          Підбір м'яких меблів для вітальні – це заняття непросте. Однак при
          виборі та покупці меблів для своєї вітальні пам'ятайте, що якісні
          м'які меблі повинні бути не тільки красивими, але й зручними для вас і
          всіх мешканців вашого будинку.
        </p>
        <div
          className='flex flex-col gap-10 desktop:gap-0 items-center desktop:justify-between
            desktop:flex-row'>
          <Button
            onClick={() => handelNavigation(currentBlog - 1)}
            buttonClassName='font-semibold  !w-[300px] '
            iconClassName='rotate-[225deg] fill-white !size-6'>
            Попередня стаття
          </Button>

          <Button
            onClick={() => handelNavigation(currentBlog + 1)}
            buttonClassName='font-semibold  !w-[300px] '
            iconClassName='rotate-45 fill-white !size-6'>
            Наступна стаття
          </Button>
        </div>
      </div>
    </section>
  )
}
